
public class Questions {
		//stage 1 given letters
		static String questions_stage1[][] = {{"Ποιος έγραψε την οδύσσεια;",
											"Πώς ονόμασε ο Οδυσσέας τον γιο του;",
											"Πώς ονομάζεται η γυναίκα του Οδυσσέα;",
											"Σε ποια θάλασσα περιπλανιέται ο Οδυσσέας;",
											"Ποια ειναι η πατρίδα του Οδυσσέα;"},
											{"Πού θεωρείται ότι βρίσκεται το νησί των σειρήνων; "
													+ "Στα στενά της…;",
											"Η Οδύσσεια αποτελείται από 12.110...;",
											"Ποιες γοήτευσαν τον Οδυσσέα με την ωραία τους φωνή "
											+ "καθώς εκείνος περνούσε από τον τόπο τους;",
											"Μέσα σε τι είχε κλείσει ο θεός Αίολος όλους τους άγριους ανέμους;",
											"Με τι βούλωσε ο Οδυσσέας τα αυτιά των συντρόφων του "
											+ "για να αποφύγουν τις σειρήνες;"},
											{"Ποιον κύκλωπα αντιμετώπισε ο Οδυσσέας;" ,
										    "Πώς λεγόταν η μάγισσα που βασίλευε την Αιαία;",
										    "Με τί αντικείμενο τύφλωσε ο Οδυσσέας τον Πολύφημο;",
											"Ποια ήταν η απάντηση που έδωσε ο Οδυσσέας στον Πολύφημο "
											+ "όταν τον ρώτησε πως ονομάζεται;",
											"Σε τι μετέτρεψε η Κίρκη τους συντρόφους του Οδυσσέα;"},
											{"Πώς ονομάζονται τα δύο τέρατα με τα οποία ήρθε "
													+ "αντιμέτωπος ο Οδυσσέας; Σκύλα και… ;" ,
											"Πόσα χρόνια κράτησε η Καλυψώ τον Οδυσσέα στο νησί της;",
											"Ποια πήρε τον Οδυσσέα στην σπηλιά της μετά τον πνιγμό"
													+ " όλων των συντρόφων του από την καταιγίδα και τα κύματα;",
											"Ποια θέα απελευθέρωσε τον Οδυσσέα και τον άφησε να φύγει"
											+ " από το νησί της Καλυψώς;",
											"Ποιος θεός έστειλε τον Ερμή στην Καλυψώ για να την "
											+ "διατάξει να απελευθερώσει τον Οδυσσέα;"},
											{"Σε  τι μετέτρεψε η Αθηνά τον οδυσσέα;",
											"Συνέχεια ποιου έπους είναι η Οδύσσεια;",
											"Πόσα μάτια είχε ο Πολύφημος;",
											"Πόσα χρόνια έλειπε ο Οδυσσέας από την Ιθάκη;",
											"Κατασκευή εμπνευσμένη από τον Οδυσσέα για την παραπλάνηση των Τρώων;... Ίππος"}};

		//stage 2 given letters
		static String questions_stage2[][] = {{"Πόσα κατορθώματα έχουν καταγραφεί ως άθλοι του Ηρακλή;",
												"Τι πήρε από την Ιππολύτη ο Ηρακλής στον 9ο άθλο του;",
												"Οι δώδεκα άθλοι προσέφεραν στον Ηρακλή;",
												"Ποιανού ο γιος είναι ο Ηρακλής;",
												"Πώς ονομάζεται ο αδερφός του Ηρακλή;"},
												{"Πού γεννήθηκε ο Ηρακλής;",
												"Ποια θεά του γάμου μισούσε τον Ηρακλή;",
												"Με ποιον τρόπο απείλησαν τον Ηρακλή και τον Ιφικλή όταν έγιναν 8 μηνών;",
												"Ο Ευρυσθέας ήταν ... του Ηρακλή;",
												"Πώς ονομάζεται η αρχιέρεια του μαντείου των Δελφών"},
												{"Ο 1ος άθλος του Ηρακλή ονομάζεται το Λιοντάρι της…;",
												"Που βρίσκονταν οι Στυμφαλίδες Όρνιθες;",
												"Τι ήταν το μεσαίο κεφάλι της Λερναίας Ύδρας;",
												"Το λιοντάρι της Νεμέας είχε ανατραφεί από τη θεά…;",
												"Ποιανού ζώου ήταν προστάτιδα η Άρτεμης;"},
												{"Πώς ονομάζεται το νερόφιδο που σκότωσε ο Ηρακλής; Λερναία….;",
												"Πόσα κεφάλια είχε η λερναία Ύδρα;",
												"Τι ήταν ο Άτλας;",
												"Με τι αντικείμενο προσπάθησε ο Ηρακλής να κόψει τα κεφάλια της λερναίας Ύδρας;",
												"Τι ζώο σκότωσε ο Ηρακλής στην Ευρύμανθο;"},
												{"Πώς λέγανε τον τρικέφαλο σκύλο του Άδη;",
												"Ποιο μυθικό τέρας φύλαγε τον κήπο των Εσπερίδων;",
												"Με τι άλειψε η Διηανειρα τον χιτώνα του Ηρακλή;",
												"Ποιος σήκωνε τον Ουρανό στους ώμους του;",
												"Με ποια θεά συμφιλιώθηκε ο Ηρακλής μετά τον θάνατό του;"}};


		//stage 3 given letters
		static String questions_stage3[][] = {{ "Ο Περιφήτης ήταν γιος του θεού...;",
												  "Σε ποια θεά έδωσε ο Πάρης το χρυσό μήλο;",
												  "Ποιο ήταν το τρωτό σημείο του Αχιλλέα;",
												  "Τι σημαίνει η λέξη δούρειος;",
												  "Ποιο μαγεμένο φρούτο έφαγαν οι σύντροφοι του Οδυσσέα;"},
												{"Ο Θησέας νίκησε τον Μινώταυρο στο ανάκτορο της...;",
											     "Ποιος ήταν ο βασιλιάς της Κρήτης;",
												  "Τι έφτιαξε ο Δαίδαλος για τον ίδιο και τον γιο του στην προσπάθεια τους να δραπετεύσουν από το νησί;",
												  "Ποιος θεός φορούσε φτερωτά σανδάλια;",
												  "Πόσα κεφάλια είχε η Σκύλλα;"},
												{"Πόσοι νέοι άνδρες θυσιάζονταν κάθε χρόνο ως φόρο τιμής στον βασιλιά της Κρήτης Μίνωα;",
											     "Ποιος σκότωσε τον μινώταυρο;",
												"Πως λεγόταν ο γιος του Δαιδάλου;",
												"Τι ποτό έπιναν οι θεοί του Ολύμπου;",
												"Πόσες ήταν οι μούσες;"},
												{"Τι χρώμα έπρεπε να είχαν τα πανιά του πλοίου σε περίπτωση που γυρνούσε ζωντανός ο Θησέας;",
												"Ποιο ήταν το σύμβολο του Ποσειδώνα;",
												"Η θεά Αφροδίτη γεννήθηκε από τον ... της θάλασσας.",
												"Η Τερψιχόρη ήταν μία από τις ...;",
												"Τι ήταν η Μέδουσα;"},
												{"Η Ιλιάδα αναφέρεται στον ... πόλεμο.",
												"Ο Θησέας, στην προσπάθειά του να βγει από τον λαβύρινθο χρησιμοποίησε…; ",
												"Τι χρώμα είχαν τα πανιά στο πλοίο του Θησέα στον δρόμο της επιστροφής;",
												"Κοντά σε τι πέταξε ο Ίκαρος;",
												"Ποιός ανέλαβε την αποστολή για το Μινώταυρο;"}};


		//stage 4 given letters
		static String questions_stage4[][] = {{"Πόσα χρόνια διήρκεσε ο Τρωικός Πόλεμος;",
												"Ποια ήταν η μητέρα του Αχιλλέα;",
												"Ποια είναι η δίδυμη αδελφή του Απόλλωνα;",
												"Ποιος θεός απήγαγε την Περσεφόνη;",
												"Ποιες μοιράζονταν μεταξύ τους ένα μάτι κι ένα δόντι;"},
											  {"Ο δούρειος ίππος στην ελληνική μυθολογία είναι κατασκευή εμπνευσμένη από τον...;",
												"Πώς ονομάζεται κάποιος που είναι μισός θεός και μισός άνθρωπος;",
												"Σε τι μετατραπόταν όποιος αντίκριζε τη μέδουσα;",
												"Πώς ονομαζόταν η μούσα της ιστορίας;",
												"Ποιος σκότωσε τον Αχιλλέα;"},
											  {"Από τι ήταν φτιαγμένα τα μαλλιά της μέδουσας;",
												"Σε ποια έδωσε ο Δίας ένα κουτί με όλα τα κακά του κόσμου;",
												"Πόσοι μνηστήρες πολιορκούσαν την Πηνελόπη;",
												"Οι νύμφες θεωρούνται πνεύματα των...",
												"Φαγητό των Θεών."},
											  {"Η ωραία Ελένη ήταν σύζυγος του...;",
												"Τέρας με σώμα λιονταριού, φτερά πτηνού και γυναικεία κεφαλή.",
												"Πώς λεγόταν το χρυσό μήλο που έδωσε ο Πάρης στην Αφροδίτη;Το μήλο της ...",
												"Τι γινόταν το χώμα που άγγιζε η Οινώ;",
												"Τι βρισκόταν στην Κνωσό;"},
											  {"Πόσες ανακωχές έγιναν κατά τη διάρκεια του πολέμου;",
												"Ποιος είναι ο αδερφός του Πάρη;",
												"Η συνάντηση του Αχιλλέα και του Πάτροκλου έγινε στον...;",
												"Ποιανού γιος ήταν ο Αχιλλέας;",
												"Σύμφωνα με την παράδοση, πόσα παιδιά είχε ο Πρίαμος;"}};


		//stage 5 given letters
		static String questions_stage5[][] = {{"Πώς ονομάζεται η δημιουργός της γης σύμφωνα με την ιστορία;",
												"Σε ποιο νησί άφησε ο Θησέας την Αριάδνη;",
												"Ένας από τους άθλους του Ηρακλή ήταν να καθαρίσει τους ... του Αυγεία.",
												"Από ποιον κένταυρο ανατράφηκε ο Ιάσονας;",
												"Ποιος σκότωσε τελικά τη Μέδουσα;"},
												{"Τι συμβόλιζε το νήμα που κρατούσαν στα χέρια τους οι 3 μοίρες;",
												"Πόσες δοκιμασίες έπρεπε να περάσει ο Ιάσονας για να καταφέρει να πάρει το χρυσόμαλλο Δέρας;",
												"Από ποιον βασιλιά ζήτησε ο Ιάσονας το χρυσόμαλλο Δέρας;",
												"Από ποια πόλη ξεκίνησε η αργοναυτική εκστρατεία;",
												"Τι έδωσε ο Προμηθέας στους ανθρώπους κι εξόργισε τους θεούς;"},
												{"Ποιος ήταν αυτός που έπαιξε με την λύρα του για να αποκοιμηθεί ο δράκος;",
												"Τι ζώο άφησαν να περάσει πρώτο τις Συμπληγάδες πέτρες οι Αργοναύτες;",
												"Ποιο ήταν το τελευταίο στοιχείο στο κουτί της Πανδώρας;",
												"Σύμφωνα με τον Πίνδαρο, ο αριθμός των αργοναυτών ήταν...;",
												"Η μόνη γυναίκα που φημολογείται ότι έλαβε μέρος στην εκστρατεία ονομαζόταν...;"},
												{"Πως ονομαζόταν ο μάντης που συμβούλεψε τους αργοναύτες πως να περάσουν τις συμπληγάδες πέτρες;",
												"Ο ακοίμητος δράκος που φύλαγε το Χρυσόμαλλο Δέρας βρισκόταν στο ιερό δάσος του Θεού;",
												"Σε ποιον θεό αφιέρωσαν το καράβι τους οι αργοναύτες;",
												"Οι Διόσκουροι ήταν αδέλφια της ...;",
												"Για να τιμωρήσει ο Δίας τον Προμηθέα, τον έδεσε σε ένα βράχο και κάθε μέρα ερχόταν ένας "
												+ "γυπαετός και του έτρωγε το...;"},
												{"Για την αρχηγεία της εκστρατείας στην αρχή, όλοι στράφηκαν στον…;",
												"Ο Ηρακλής αποφάσισε να ακολουθήσει το δύσκολο μονοπάτι της ...",
												"Η μέδουσα πριν μετατραπεί σε τέρας ήταν η πιο όμορφη ιέρεια της θεάς ...",
												"Οι Σάτυροι από τη μέση και κάτω είχαν τη μορφή ...;",
												"Ποια ήταν η απάντηση του αινίγματος που έθετε η Σφίγγα στους περαστικούς;"}};
		
		/*This method return the question given level and round 
		 * according to which of the 5 possible array of questions we
		 * got from the random variable in the boardPanel class
		 */
		public static String getQuestion(int i, int j, int q) {
			if (q == 0) {
				return questions_stage1[i][j];
			} else if (q == 1) {
				return questions_stage2[i][j];
			} else if (q == 2) {
				return questions_stage3[i][j];
			} else if (q == 3) {
				return questions_stage4[i][j];
			} else {
				return questions_stage5[i][j];
			}
		}

}
