import java.util.Random;

public class Letters {
	Random r = new Random();
			
		//stage 1 given letters
		static String stage1[][] = {{"ΡΗΜΟΣΟΒΟΠΗ",
								     "ΛΑΤΕΧΟΣΗΜΟ",
								     "ΝΗΠΗΠΕΛΟΙΖ",
								     "ΣΕΙΣΟΓΠΜΕΟ",
		                          	 "ΘΙΚΗΑΟΝΕΣΔ"},
								  	{"ΣΕΣΗΣΜΝΗΡΗ",
		                             "ΦΣΧΤΒΙΥΣΣΟ",
		                          	 "ΝΗΡΙΕΣΕΣΛΗ",
		                          	 "ΑΣΒΖΜΙΔΚΟΙ",
		                          	 "ΡΕΚΙΗΠΕΛΟΙ"},
								  	{"ΦΥΛΟΠΗΜΟΘΙ",
		                          	 "ΚΙΑΨΗΚΡΟΜΙ",
		                          	 "ΝΕΝΑΣΚΑΟΓΠ",
		                          	 "ΔΑΚΛΙΗΑΟΝΕ",
		                          	 "ΟΙΡΜΟΚΣΧΥΣ"},
								  	{"ΒΑΧΡΗΔΥΣΜΝ",
		                          	 "ΕΠΑΤΕΝΑΣΚΑ",
		                          	 "ΛΑΚΥΨΩΗΡΙΕ",
		                          	 "ΝΗΑΘΑΕΛΟΙΖ",
		                          	 "ΣΑΙΔΧΝΑΛΗΜ"},
								  	{"ΑΝΙΤΗΖΟΚΑΟ",
		                             "ΟΙΔΛΑΙΑΟΔΣ",
		                          	 "ΔΥΕΓΑΗΝΟΠΛ",
		                          	 "ΣΕΙΜΙΣΟΑΚΠ",
		                          	 "ΕΟΔΚΑΥΟΡΣΙ"}};
		
		//stage 2 given letters
		static String stage2[][] = {{"ΚΩΔΑΔΕΗΙΠΦ",
									 "ΣΑΗΜΩΖΛΟΝΕ",
									 "ΜΗΦΗΤΧΙΑΜΟ",
								     "ΑΔΙΟΑΠΤΡΔΨ",
								     "ΚΙΛΗΦΙΣΑΦΤ"},
								    {"ΤΒΞΑΡΠΧΜΚΗ",
								     "ΒΤΚΑΟΕΘΓΗΠ",
								     "ΑΔΩΙΔΟΠΑΙΦ",
								     "ΔΜΦΑΛΟΣΕΑΞ",
								     "ΖΥΠΙΦΝΑΘΥΜ"},
								    {"ΝΓΗΑΣΔΑΕΜΕ",
								     "ΟΡΝΙΔΟΘΛΑΚ",
								     "ΔΑΜΘΖΑΑΝΟΤ",
								     "ΔΤΑΝΜΡΗΠΖΑ",
								     "ΦΛΥΙΑΜΕΠΟΣ"},
								    {"ΛΑΤΗΔΡΥΟΓΩ",
								     "ΑΤΗΥΝΕΝΕΨΒ",
								     "ΜΑΤΣΟΙΠΤΝΑ",
								     "ΠΡΤΙΝΑΜΑΔΕ",
								     "ΓΑΙΝΟΙΥΡΟΥ"},
								    {"ΒΕΜΔΚΕΣΡΟΡ",
								     "ΦΡΑΛΟΚΔΖΨΣ",
								     "ΜΕΡΑΙΟΠΑΣΔ",
								     "ΠΑΚΣΜΛΤΙΣΑ",
								     "ΡΤΑΜΙΟΡΗΠΕ"}};
		
		//stage 3 given letters
		static String stage3[][] = {{"ΜΦΤΙΣΗΠΑΟΥ",
									 "ΦΑΛΟΙΗΔΤΡΜ",
								     "ΜΤΑΖΡΝΠΕΛΦ",
								     "ΝΛΙΖΞΟΑΣΥΠ",
								     "ΜΝΛΩΟΛΚΜΤΜ"},
								    {"ΣΝΩΥΚΟΛΕΠΥ",
								     "ΝΩΛΑΟΙΜΣΛΠ",
								     "ΤΕΦΜΑΡΛΦΠΑ",
								     "ΜΛΠΡΗΑΣΛΠΕ",
								     "ΡΣΕΠΥΡΙΚΟΞ"},
								    {"ΠΛΙΟΤΚΑΗΠΕ",
								     "ΣΕΜΛΑΘΝΗΣΠ",
								     "ΛΚΑΜΟΣΡΙΔΜ",
								     "ΕΦΜΚΝΛΠΑΡΤ",
								     "ΑΝΠΕΒΝΛΕΔΣ"},
								    {"ΠΒΥΡΣΑΚΛΠΟ",
								     "ΑΙΜΖΝΡΜΙΤΑ",
								     "ΖΜΟΛΡΗΣΑΠΦ",
								     "ΣΚΣΟΥΨΕΜΖΑ",
								     "ΔΟΓΠΓΝΡΑΟΛ"},
								    {"ΜΩΟΛΚΡΤΠΙΑ",
								     "ΑΛΞΗΤΩΣΚΙΗ",
								     "ΡΑΦΛΑΗΠΚΥΜ",
								     "ΑΜΟΖΙΛΠΔΙΗ",
								     "ΗΒΠΣΑΕΣΒΠΘ"}};
		
		//stage 4 given letters
		static String stage4[][] = {{"ΚΗΘΕΑΓΕΗΛΔ",
								     "ΑΤΥΔΘΤΕΝΜΙ",
								     "ΦΤΡΛΙΑΜΣΕΠ",
								     "ΣΦΔΑΙΤΗΚΤΗ",
								     "ΛΙΑΜΓΡΣΠΕΦ"},
								    {"ΑΥΔΟΤΣΕΣΞΛ",
								     "ΟΕΜΡΤΛΣΑΠΙ",
								     "ΑΟΣΚΘΜΗΛΙΕ",
								     "ΣΜΕΙΦΠΚΛΑΩ",
								     "ΡΕΤΣΑΗΔΩΓΠ"},
								    {"ΔΑΛΙΦΜΖΙΠΟ",
								     "ΑΔΖΠΜΩΑΛΡΝ",
								     "ΑΡΛΜΑΣΤΝΑΠ",
								     "ΟΠΞΝΩΚΑΜΤΕ",
								     "ΒΣΜΟΑΡΙΣΠΑ"},
								    {"ΕΛΑΥΝΛΞΟΜΕ",
								     "ΜΦΙΑΓΛΟΓΣΠ",
								     "ΣΑΜΙΛΔΡΠΣΕ",
								     "ΦΑΡΜΚΙΛΣΠΑ",
								     "ΚΡΟΝΓΑΔΤΑΑ"},
								    {"ΥΔΙΠΝΟΟΔΡΩ",
								     "ΗΟΑΚΤΡΛΟΕΣ",
								     "ΜΟΝΑΜΔΞΝΗΕ",
								     "ΗΑΚΛΜΠΑΕΓΥ",
								     "ΠΕΝΤΟΖΑΝΗΥ"}};
		
		//stage 5 given letters
		static String stage5[][] = {{"ΕΚΑΓΦΗΙΘΕΑ",
								     "ΔΙΝΗΞΟΛΑΗΣ",
								     "ΒΤΗΣΛΑΒΥΟΣ",
								     "ΧΙΕΜΩΠΑΝΡΑ",
								     "ΗΣΑΛΕΠΧΡΣΕ"},
								    {"ΑΓΕΓΩΤΗΖΙΧ",
								     "ΧΓΕΡΙΑΣΥΤΩ",
								     "ΑΣΙΥΓΗΞΤΝΗ",
								     "ΜΩΑΚΠΛΟΙΦΑ",
								     "ΩΦΚΛΟΑΙΜΦΤ"},
								    {"ΚΟΗΥΝΦΡΑΕΣ",
								     "ΠΕΡΙΑΡΕΤΙΣ",
								     "ΛΙΜΕΠΩΑΔΙΟ",
								     "ΕΗΥΚΔΡΝΑΜΩ",
								     "ΠΑΤΑΝΑΛΩΤΗ"},
								    {"ΦΛΥΚΤΑΙΝΕΣ",
								     "ΡΤΡΗΧΙΓΦΩΑ",
								     "ΟΠΩΑΝΙΕΔΣΟ",
								     "ΦΗΛΕΑΕΗΠΝΣ",
								     "ΩΚΔΙΣΑΤΚΥΑ"},
								    {"ΚΑΜΗΛΙΕΡΗΣ",
								     "ΕΡΚΙΣΗΠΑΤΩ",
								     "ΗΠΘΑΜΣΩΝΑΥ",
								     "ΣΑΕΥΡΓΑΥΟΤ",
								     "ΝΘΣΩΟΑΣΠΟΡ"}};

	
		/*This method return the letters of the correct answer of the given level and round 
		 * according to which of the 5 possible array of questions we
		 * got from the random variable in the boardPanel class
		 */
		public static String getLetter(int i, int j, int q) {
			if (q == 0) {
				return stage1[i][j];
			} else if (q == 1) {
				return stage2[i][j];
			} else if (q == 2) {
				return stage3[i][j];
			} else if (q == 3) {
				return stage4[i][j];
			} else {
				return stage5[i][j];
			}
		}

}
